//**************************************************
//* Περιβαλλοντική Ομάδα 5ου Γυμνασίου Πτολεμαΐδας *
//* ---------------------------------------------- *
//* Week1: Ενδεικτικός κώδικας σύνδεσης και λει-   *
//* τουργίας αισθητήρα υγρασίας - εδάφους          *
//**************************************************

const int hygrometer = A0;	// Σταθερά με όνομα hygrometer όπου αντιστοιχίζεται με την
							// αναλογική είσοδο Α0 όπου συνδέουμε τον αισθητήρα εδάφους 
							
int value;					// Μεταβλητή που δέχεται τιμές από τον αισθητήρα
							// από 0 (μέγιστη υγρασία) μέχρι 1023 (ελάχιστη υγρασία)
							// Ο κατασκευαστής προτείνει τιμή 380 - 400 για την παρουσία
							// σωστής υγρασίας για τα περισσότερα φυτά

void setup() 
{
  // Κώδικας αρχικοποίησης αισθητήρα (ορισμός συχνότητας λειτουργίας στα 9600 bps)
  Serial.begin(9600);
}

void loop() 
{
  // H ρουτίνα loop λειτουργεί ξανά και ξανά επαναληπτικά και συνεχόμενα

  value = analogRead(hygrometer);		// Ανάγνωση από τον αισθητήρα

  // Εμφάνιση της τιμής στην κονσόλα παρακολούθησης του Arduino IDE
  // και επανεμφάνιση μετά από δύο δευτερόλεπτα
  
  Serial.print("Υγρασία: ");
  Serial.print(value);		// εμφάνιση 
  Serial.println();			// αλλαγή γραμμής
  delay(2000);				// καθυστέρηση 2 δευτερολέπτων
}
