//**************************************************
//* Περιβαλλοντική Ομάδα 5ου Γυμνασίου Πτολεμαΐδας *
//* ---------------------------------------------- *
//* Week4: Ενδεικτικός κώδικας απενεργοποίησης της *
//* λειτουργίας του ρελέ (ηλεκτρονικού διακόπτη)   *
//**************************************************

#define RELAY 8                   //Σύνδεση διακόπτη στην έξοδο 8 του Arduino

void setup()
{  
  pinMode(RELAY, OUTPUT);         //Κώδικας αρχικοποίησης (έναρξης επικοινωνίας με το ρελέ)
}

void loop()
{
     digitalWrite(RELAY, LOW);   //Διακόπτης στο OFF
}
